"""
Напишите программу, которая вычисляет среднее арифметическое четырех введенных целых чисел.

Числа вводятся в одну строку через пробел
"""
A,B,C,D = map(int,input().split())
print((A+B+C+D)/4)