"""
Напишите программу, которая вычисляет длину отрезка
(т.е. расстояние между двумя точками),
заданного двумя значениями x1 и x2 (вещественные числа).
"""

a = float(input())
b = float(input())
c = abs(a-b)
print(c)
