"""
Дано целое положительное число, ваша задача вывести разряд сотен этого числа
"""
a =  int(input())
print((a // 100)%10)