
"""
1.3.1 Какое значение мы увидим в консоли, если ввести команду 19 + 3.0 ?
 22.0

1.3.2 Сколько будет, если в python ввести команду 36 / 6
6.0

1.3.3 Посчитайте результат операции 4 + 2 * 5
14

1.3.4 Каким знаком обозначается операция взятия остатка от деления ?
"%"

1.3.5 Посчитайте результат операции 56%10
6

1.3.6 Какой результат операции 8%41 ?
8

1.3.7 Каков будет результат операции 89 // 15
5

1.3.8 Посчитайте результат операции 17 - 45 // 8
12

1.3.9 Заполните пропуски 2 ** 5
32

1.3.10 Заполните пропуски 100 / 2 ** 2
25.0

1.3.11 Как обозначается функция нахождения модуля числа?
"abs"

1.3.12 Какое значение мы увидим в консоли, если ввести команду 16 ** 0.5 ?
4.0

1.3.13 Какой результат у команды abs(-100) + abs(-13) ?
113

1.3.14 Какой результат у команды max(345, 13, 89, 4392, 76) - 392
4000

1.3.15  Какой результат у команды round(1/3, 2)
0.33

"""
